Documents/упДокументТранспортногоСредстваВодителя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>упДокументТранспортногоСредстваВодителя</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.упДействующиеДокументыТСВодителей</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидПропускаНаВъездВыездВЗону</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упВидыПропусковНаПроездЧерезЗону</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выдан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДействуетПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДействуетС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упДокументТранспортногоСредстваВодителя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеограниченноеЧислоВодителей</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеограниченноеЧислоТС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПартнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТипыДокументовТСВодителей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТранспортныеСредства</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТранспортноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упТранспортныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Водители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Водитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упСотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Категории</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Категория</Name>
							<Type>
								<v8:Type>cfg:EnumRef.упКатегорииВодительскогоУдостоверения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/упДействующиеДокументыТСВодителей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упДействующиеДокументыТСВодителей</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДействуетПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТипыДокументовТСВодителей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/упОбъектДокументовТСВодителей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упОбъектДокументовТСВодителей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТранспортноеСредство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Водитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТСВодитель</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/упКоличествоОбъектовДокументовТСВодителей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упКоличествоОбъектовДокументовТСВодителей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Один</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Несколько</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозможноНеограниченноеЧисло</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/упТипыДокументовТСВодителей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упТипыДокументовТСВодителей</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументВыдается</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упОбъектДокументовТСВодителей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредупреждатьОбОкончанииСрокаДействия</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтервалПредупреждения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоТС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упКоличествоОбъектовДокументовТСВодителей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоВодителей</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упКоличествоОбъектовДокументовТСВодителей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упСрокДействияДокумента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодДействия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/упДокументТранспортногоСредстваВодителя/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Если ТипДокумента.ДокументВыдается = Перечисления.упОбъектДокументовТСВодителей.Водитель ИЛИ НеограниченноеЧислоТС Тогда 
		ТранспортныеСредства.Очистить();
	КонецЕсли;	
	Если ТипДокумента.ДокументВыдается = Перечисления.упОбъектДокументовТСВодителей.ТранспортноеСредство ИЛИ НеограниченноеЧислоВодителей Тогда 
		Водители.Очистить();
	КонецЕсли;	
	
	Если ТипДокумента.КоличествоВодителей = Перечисления.упКоличествоОбъектовДокументовТСВодителей.Один Тогда 
		КоличествоСтрок = Водители.Количество();
		Для Сч = 1 По КоличествоСтрок - 1 Цикл 
			Водители.Удалить(КоличествоСтрок - Сч);
		КонецЦикла;
	КонецЕсли;	
	Если ТипДокумента.КоличествоТС        = Перечисления.упКоличествоОбъектовДокументовТСВодителей.Один Тогда 
		КоличествоСтрок = ТранспортныеСредства.Количество();
		Для Сч = 1 По КоличествоСтрок - 1 Цикл 
			ТранспортныеСредства.Удалить(КоличествоСтрок - Сч);
		КонецЦикла;
	КонецЕсли;	
	
	Если ТипДокумента = ПредопределенноеЗначение("Справочник.упТипыДокументовТСВодителей.ПропускНаПроездТранспортаЧерезЗону") Тогда
		Если НЕ ЗначениеЗаполнено(ВидПропускаНаВъездВыездВЗону) Тогда
			ТекстСообщения = Нстр("ru = 'Укажите Вид пропуска !!!'");		
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект,"ВидПропускаНаВъездВыездВЗону", , Отказ);
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЗначениеЗаполнено(ДокументОснование) И ДокументОснование = Ссылка Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Неверно заполнен предыдущий документ (цикличная ссылка)'"), Ссылка, "Объект.ДокументОснование",, Отказ);
	КонецЕсли;
	
	Если ТипДокумента.ДокументВыдается = Перечисления.упОбъектДокументовТСВодителей.Водитель ИЛИ НеограниченноеЧислоТС Тогда 
		ТранспортныеСредства.Очистить();
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "ТранспортныеСредства");
	КонецЕсли;	
	Если ТипДокумента.ДокументВыдается = Перечисления.упОбъектДокументовТСВодителей.ТранспортноеСредство ИЛИ НеограниченноеЧислоВодителей Тогда 
		Водители.Очистить();
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "Водители");
	КонецЕсли;	
	
	Если ТипДокумента.КоличествоВодителей = Перечисления.упКоличествоОбъектовДокументовТСВодителей.Один Тогда 
		КоличествоСтрок = Водители.Количество();
		Для Сч = 1 По КоличествоСтрок - 1 Цикл 
			Водители.Удалить(КоличествоСтрок - Сч);
		КонецЦикла;
	КонецЕсли;	
	Если ТипДокумента.КоличествоТС        = Перечисления.упКоличествоОбъектовДокументовТСВодителей.Один Тогда 
		КоличествоСтрок = ТранспортныеСредства.Количество();
		Для Сч = 1 По КоличествоСтрок - 1 Цикл 
			ТранспортныеСредства.Удалить(КоличествоСтрок - Сч);
		КонецЦикла;
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	мсвТС = ТранспортныеСредства.ВыгрузитьКолонку("ТранспортноеСредство");
	Если Не мсвТС.Количество() Тогда 
		мсвТС.Добавить(Неопределено);
	КонецЕсли;
	
	мсвВодителей = Водители.ВыгрузитьКолонку("Водитель");
	Если Не мсвВодителей.Количество() Тогда 
		мсвВодителей.Добавить(Неопределено);
	КонецЕсли;
	
	Для Каждого текТС Из мсвТС Цикл 
		Для Каждого текВодитель Из мсвВодителей Цикл 
			НоваяЗапись = Движения.упДействующиеДокументыТСВодителей.Добавить();
			НоваяЗапись.Период               = ДействуетС;
			НоваяЗапись.Регистратор          = Ссылка;
			НоваяЗапись.ТипДокумента         = ТипДокумента;
			НоваяЗапись.ТранспортноеСредство = текТС;
			НоваяЗапись.Водитель             = текВодитель;
			НоваяЗапись.ДействуетПо           = ДействуетПо;
		КонецЦикла;
	КонецЦикла;
	
	Движения.упДействующиеДокументыТСВодителей.Записывать = Истина;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ДокументОснование = ОбъектКопирования.Ссылка;
	ДействуетС        = ОбъектКопирования.ДействуетПо + 86400;
	ДействуетПо       = ДействуетС + (ОбъектКопирования.ДействуетПо - ОбъектКопирования.ДействуетС);
	Номер             = "";
	Серия             = "";
	Выдан             = "";
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
